-- Отсортированные списки (по 5 значений) самых часто используемых индексов:

SELECT *
FROM pg_stat_all_indexes
WHERE schemaname = 'public'
ORDER BY idx_scan DESC LIMIT 5;

/*
|:----------|:--------------|:--------------|:------------------|:----------------------|:----------|:----------------------------------|:--------------|:--------------|
| relid     | indexrelid    | schemaname    | relname           | indexrelname          | idx_scan  | last_idx_scan                     | idx_tup_read  | idx_tup_fetch |
|:----------|:--------------|:--------------|:------------------|:----------------------|:----------|:----------------------------------|:--------------|:--------------|
| 44321     | 44325         | public        | halls             | halls_pkey            | 30030035  | 2025-04-04 05:43:06.729418 +00:00 | 30030034      | 30030034      |
| 44375     | 44379         | public        | place_categories  | place_categories_pkey | 30030006  | 2025-04-03 15:10:03.963305 +00:00 | 30030005      | 30030004      |
| 44358     | 44362         | public        | sessions          | sessions_pkey         | 20116796  | 2025-04-04 05:43:06.729418 +00:00 | 20118295      | 20118286      |
| 44333     | 44341         | public        | films             | films_pkey            | 10366120  | 2025-04-04 05:46:41.148786 +00:00 | 10366119      | 10366060      |
| 44344     | 44350         | public        | orders            | orders_pkey           | 10010072  | 2025-04-04 05:43:06.729418 +00:00 | 10011071      | 10011004      |
|:----------|:--------------|:--------------|:------------------|:----------------------|:----------|:----------------------------------|:--------------|:--------------|
*/




-- Отсортированные списки (по 5 значений) самых редко используемых индексов:

SELECT *
FROM pg_stat_all_indexes
WHERE schemaname = 'public'
ORDER BY idx_scan
LIMIT 5;

/*
|:----------|:--------------|:--------------|:------------------|:--------------------------|:----------|:----------------- |:--------------|:--------------|
| relid     | indexrelid    | schemaname    | relname           | indexrelname              | idx_scan  | last_idx_scan     | idx_tup_read  | idx_tup_fetch |
|:----------|:--------------|:--------------|:------------------|:--------------------------|:----------|:----------------- |:--------------|:--------------|
| 44413     | 44483         | public        | price_list        | idx-price_list-price      | 0         |                   | 0             | 0             |
| 44310     | 44318         | public        | clients           | clients_email_key         | 0         |                   | 0             | 0             |
| 44358     | 44479         | public        | sessions          | idx-sessions-created_at   | 0         |                   | 0             | 0             |
| 44375     | 44381         | public        | place_categories  | place_categories_name_key | 0         |                   | 0             | 0             |
| 44384     | 44486         | public        | places            | idx-places-row            | 0         |                   | 0             | 0             |
|:----------|:--------------|:--------------|:------------------|:--------------------------|:----------|:----------------- |:--------------|:--------------|
*/
