insert into movie (name) values
    ('Крестный отец'),
    ('Титаник'),
    ('Начало'),
    ('Матрица'),
    ('Интерстеллар'),
    ('Назад в будущее'),
    ('Побег из Шоушенка'),
    ('Список Шиндлера'),
    ('Криминальное чтиво'),
    ('Трон: Наследие');

insert into attribute (name, type) values
    ('Стоимость фильма', 'real'),
    ('Режиссёр', 'text'),
    ('Страна', 'text'),
    ('Жанр', 'text'),
    ('Длительность в минутах', 'integer'),
    ('Рейтинг', 'real'),
    ('Год выпуска', 'integer'),
    ('Дата премьеры', 'date'),
    ('Оскар', 'boolean');