CREATE TABLE IF NOT EXISTS users (
    id SERIAL PRIMARY KEY,
    name VARCHAR(512) NOT NULL,
    phone BIGINT NULL
);

TRUNCATE TABLE users RESTART IDENTITY;

INSERT INTO users (name, phone) VALUES
    ('Александр Иванов', 89990000001),
    ('Мария Петрова', 89990000002),
    ('Иван Сидоров', 89990000003),
    ('Ольга Смирнова', 89990000004),
    ('Дмитрий Кузнецов', 89990000005),
    ('Анна Попова', 89990000006),
    ('Евгений Бутов', 89990000007),
    ('Елена Соколова', 89990000008),
    ('Павел Морозов', 89990000009),
    ('Наталья Новикова', 89990000010),
    ('Кирилл Федоров', NULL),
    ('Татьяна Орлова', 89990000012);
